{
  "galleryItems": [
    {
      "type": "video",
      "src": "assets/videos/sledger-full.mp4",
      "title": "Stinger",
      "description": "A 3d concept for an enemy for the indie game Sledge; the idea was to create a creature that was part of a highly advanced artificial intelligence; one that was associated with 'Heaven,' and tried to usurp it's place in the natural order. It was supposed to connote themes of religious significance, but also extreme technological advancement, without being too alien or foreign. This concept leans more on the alien/foreign side, yet was really fun to make and see visualized. The rig for the creature involves mostly the head though also some IK for the spine and stinger, as it's main attack was supposed to come from the stinger portion of it's belly. This done over a couple of days, for the rig and character and everything, including fine tuning and the whole bit; this was more of a concept/rig test, less of a final textured test, though I was able to do it in blender all by myself. This was also done after college and after a hiatus of not working on the project, and was more done by me to try and get everyone hyped about working on it again. It did not work."
    },
    {
      "type": "video",
      "src": "assets/videos/looping.mp4",
      "title": "Altar",
      "description": "A piece of art I made by myswelf to try and dig deeper into environment art, and just to showcase my chops a little and expand out from doing things related 100% to game projects. For this one I knew I wanted to do something lovecraftian, with tentacles and sacrificial altar tendencies. For the final bit, I really only modeled/rigged a single tentacle, I wanted to add more to create more of a biological mass of dread, yet they were effective at quickly creating a type of lovecraftian altar type thingimajig. As for the guy; I wanted to have him come in to complete the piece with a bit of story, and it was supposed to be serious but I was showing it to my brother and while doing so accidentally (potentially purposefully) enlarged the guy's feet as a joke; we both laughed, then looked seriously at our new creation with newfound wonder and admiration; it was too beautiful, too pure... it simply had to be kept in. I'm very grateful he's a size 9 in clown foot size because it adds a really essential element to the piece that would be missing without it."
    },
    {
      "type": "video",
      "src": "assets/videos/interceptor.mp4",
      "title": "Interceptor",
      "description": "A final product for Sledge, an indie game I was working on while in college; this is a creature that I did concept art for, and did the final rig, and idle animation. The model/texture was done by another member of our team. This was the classic ranged sniper enemy, filling the boots of the jackal from Halo or the sniper robot from Ultrakill, or literally any other squishy sniper enemy from most other games involving enemies and or shooting. They were supposed to be more of an intelligence/reconnaissance unit, so I wanted their design to show that part of their figure off; and that's sort of where the head/eye prominence comes in. They are very weak and thus very thin in their design, literally just being a spine on legs with a head and a gun. Yet, I feel like it does have a bit of a creepy or otherworldly presence; you definitely wouldn't want to see this guy in your closet late at night (though he'd see you that's for sure). Anywho yeah, this one was fun to do but was also a bit of a challenge, as I had not rigged a spine like this before with it's complexity, or a chest that could travel up and down it so that was new to me. Overall, I could definitely have done better, but it was good to get more experience with IK/FK switching in bones that involve spinal tapping."
    },
    {
      "type": "video",
      "src": "assets/videos/hunsk.mp4",
      "title": "Husk",
      "description": "A battle of the ages, a continual conflict between man and floating eye ball. This is obviously inspired somewhat by Terraria, with the floating eye and tentacles n whatnot, though also has some other influences; the humanoid creature is a 'husk,' by my estimations, and is a creature that I've thought of for a while in my own worldbuilding sphere; they're creatures which have been depleted of all their worldly motivations and positive emotions (whether it be by magic or technology or sheer bad luck), and have been replaced solely with obsession with any sort of material possessions (which are few and far between for these fellas), extreme depression and self loathing, or any number of physical maladies which affect them. They are people which gave up long ago, and are now easily swayed by the powers that be which use their desires for simple pleasures top control them to do their wicked bidding. Totally not inspired by the Husk from ultrakill. (this was also a quick project I made from start to finish, with the model, texture, rig, and animation, just for a fun personal project of mine)."
    },
    {
      "type": "video",
      "src": "assets/videos/walker_bug.mp4",
      "title": "Bug",
      "description": "Definitely not my own bastardized version of the Glyphids from Deep Rock Galactic. This was actually for an extremely ambitious mech project that I dropped after 10 minutes of working on it a while ago, but I wanted a fun classic bug enemy, and I just whipped up this guy and put him in the game. The model itself is super basic and rushed, with extremely barely deformed cubes making up the main body parts of the dude. The texture as well was one of my first attemtps at layering in blender, with adding different coats of paint for detail and flesh vs armor and whatnot. I thought it was a neat stylistic choice to keep the lines in between the bug, as I thought it made it look 'unique' and 'special.' Obviously now, I still think the exact same way. The rig is also very simple, with just IK set up for the legs so that it can walk at targeted positions, and so the body can move around independently. The whole thing was very quick, and probably only took a couple hours all in all. Definitely shows though."
    },
    {
      "type": "image",
      "src": "assets/images/ruined_knights4.png",
      "title": "Ruined Knights",
      "description": "Here's another type of character/enemy/whatever you want to call it from one of my personal projects; This is the same rig as the Husk from my other gallery image reference (the guy with the floating eyeball), it's just the same guy with some armor and sword slapped on top. I wanted to make him way cooler and more like the (demons? end-bringers?) weird creatures with glowing red armor from League of Legends, or really more like the Daedric Armor from Skyrim. Obviously, my goals were set high, and I met them to the best of my capabilities (within my artificially created time constraints), yet this was what popped out. Just a neat lil enemy type of guy. I don't really know what else to say. I think the results are rather self explanatory. Oh, I did use shaders to get different colors within Blender, that was really fun. And the tentacles on his body that connect to the sword and to himself are set up with IK; so that helped me get more comfortable with creating necks/muscles that deform naturally according to rotations. There are no shape keys, just fake knees. I like making different colored variations of the same character; it's something I hate in games, facing against characters who are the exact same as another enemy just colored differently, but it's fun to see/make art-wise to see how your creations could look different."
    },
    {
      "type": "image",
      "src": "assets/images/art7.gif",
      "title": "Solarpunk",
      "description": "This guy is a real Solar Punk, if you know what I mean. This was also done for a personal project, and was brought into unity as a character that you can interact with. The animation was very barebones, but what was really fun in making this one was getting to experiment with pixel art shaders, which is something I think looks really beautiful, and I wanted to display. This was done in blender simply by scaling down the image and then scaling it back up, but I think it looks really cool and is a great first shader that everyone should learn how to do; especially with the bloom being applied before the shader, you get some cool pixels of the surrounding light around the guy's eye which is neat. Immediately after I brought this guy into Unity I worked on recreating the pixel art effect in URP, and then I made a small platforming protoype where you can walk around and jump between platforms, and boom you have a tiny game that you can show off. I'm pretty proud of it."
    },
    {
      "type": "video",
      "src": "assets/videos/walk_cycle_proper.mp4",
      "title": "Basic Enemy Walk Cycle",
      "description": "Another robot that I concepted for the indie game Sledge. This just showcases a walk cycle that I made for the enemy, which was implemented into Unity. I only made the rig and the animation when it comes to the final model, the modeling/texturing was done by another member of our staff. These guys are supposed to be the 'grunts,' like the basic enemies which you encounter which shoot bullets at you, move relatively slowly, and just try and be a nuisance to you. The game is more of a platformer than a combat game, so the detail was less in making them try and fight you, and more exist in the environment."
    },
    {
      "type": "video",
      "src": "assets/videos/Whopper.mp4",
      "title": "Ragdoll Physics",
      "description": "This is an example of my technical artist skillset; I was tasked with creating a ragdoll physics setup for the basic enemy character that we have in the game; not only so that they fall over as a ragdoll, but also split apart into a bunch of different pieces. Here the forces can be applied to any specific body part, as well as limits on the necessary force required to split apart the target pieces, the direction of the force, and whether or not the piece will automatically disconnect. This was set up with an elaborate chain of configurable joints in Unity, which creates a character that can be dynamically blown up and have it respond to realistic stimulus in a very interesting way. All of that technical nincompoop to say; hit robot hard, robot break. Fun stuff; I also set up a series of cables to the robot later, so that there are wires that sort of simulate organs; they will disconnect from each other if they are pulled apart too hard."
    },
    {
      "type": "video",
      "src": "assets/videos/perihelion.mp4",
      "title": "Perihelion",
      "description": "This is a personal project that I've been working on, working title Perihelion. So far it's rather barebones, and all you can do is really walk around and platform, take fall damage, get healed, and interact by walking near the horn guy. It was really fun though to make a camera controller that natively follows the player and is focused on not just the player but also points of interest, such as the platform they're currently on, or enemies, or focal points. The UI was really fun as well; since there is a shader that has a pixel art/slight ps1 filter over the screen, there needed to be a way to read the UI without it being too nonsensical, or loosing that pixel art feeling. What I ended up doing was setting up multiple different cameras; one that renders all the icons/logos (currently there's just the health bar), and one for the text. The camera that renders the logos does so with the pixel art filter attached, so that way the health bar can have noticeably pixel increments (which I find to be very satisfying), and the text camera doesn't have that filter, so the text can be rendered with a basic pixel art font so it stays crispy and readable all while giving an old timey cozy feeling. I enjoyed making this a lot, and it's playable up on my itch right here: https://shovelsquid.itch.io/perihelion"
    },
    {
      "type": "video",
      "src": "assets/videos/sledgimations.mp4",
      "title": "Sledge First Person Animations",
      "description": "A quick showcase of the rig for the first person player animations in Sledge. All I did here was set up the rig and do the animations; the modeling and texturing was done by our other artist. This was really fun though; the weapon is rigged as part of the armature, and both the hands are attached to it. The hands are able to move around, rotate, twist, and what not freely; they also have scaling constraints applied to them which is really nice. However, for all movements, all I have to do with the rig is simply move around the hammer and things will go smoothly, the rest of the rig will respond appropriately. These were brought into unity, and work as part of the main player animations for the game."
    }
  ]
}
